name: "onnx-AlexNet"
platform: "onnxruntime_onnx"
max_batch_size: 64


input [
    {
        name: "images"
        data_type: TYPE_FP32
        dims: [ 3, 32, 32 ]
    }
]

output [
    {
        name: "proba_distr"
        data_type: TYPE_FP32
        dims: [ 10 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]

dynamic_batching: {max_queue_delay_microseconds: 100}
